# 2. Даны два числа. Показать большее и меньшее число
a = 52
b =10
if a>b:
    print(a, ',', b)
else:
    print(b, ',', a)