# 15. Написать программу получающую набор произведений чисел от 1 до N.
# Пример: пусть N = 4, тогда
# [ 1, 2, 6, 24 ]

def f(x):
    l = [1]
    for i in range(1, x + 1):
        l.append(i * l[i - 1])
    l.remove(l[0])
    return l


print(f(5))
